// function setup() {
//   setCanvasContainer('p5-canvas', 600, 600);
//   background('white');

function setup() {
  createCanvas(600, 600);
  background('white');
}

function draw() {
  background('#FFF4D9');
  //초기화, 설정값
  rectMode(CORNER);
  colorMode(RGB); //컬러
  strokeWeight(1); //선 두께

  //바닥
  stroke('#316BFF'); //선 색상
  fill('#FFEEC1'); //노란색
  rect(0, 470, 600, 130);

  //카펫
  fill('#CCEDFF'); //노란색
  quad(68, 500, 532, 500, 587, 600, 12, 600);

  //문
  stroke('#316BFF'); //선 색상
  fill('#FFFFFF'); //흰색
  rect(25, 37, 290, 433, 3, 3, 0, 0); //문 테두리
  rect(40, 50, 260, 420, 3, 3, 0, 0); //문 안쪽

  //하늘
  stroke('#316BFF'); //선 색상
  fill('#CBE2FF'); //하늘색
  rect(56, 65, 99, 212, 3); //왼쪽창
  rect(185, 65, 99, 212, 3); //오른쪽창

  //문 세부요소
  stroke('#316BFF'); //선 색상
  fill('#FFFFFF'); //흰색
  rect(56, 242, 99, 12); //왼쪽창 세로선
  rect(185, 242, 99, 12); //오른쪽창 세로선
  line(170, 50, 170, 470); //중앙 세로선

  rect(56, 293, 99, 162, 3); //왼쪽아래
  rect(185, 293, 99, 162, 3); //오른쪽아래
  rect(68, 305, 75, 139, 3); //왼쪽아래안쪽
  rect(197, 305, 75, 139, 3); //오른쪽아래안쪽

  ellipse(155, 293, 15); //왼쪽 손잡이
  ellipse(185, 293, 15); //왼쪽 손잡이

  //오른쪽 창가 구름
  fill('#FFFFFF');
  noStroke(); //스트로크 없애기
  rect(64, 66, 35, 9, 0, 0, 50, 50); //맨위 잘린구름
  rect(102, 86, 52, 33, 20, 0, 0, 20); //오른쪽 큰 잘린구름
  rect(74, 109, 58, 20, 20); //그아래 구름
  rect(57, 148, 52, 20, 0, 20, 20, 0); //왼쪽 잘린 구름
  rect(76, 158, 58, 20, 20); //그아래 구름
  //왼쪽 창가 구름
  rect(186, 86, 27, 30, 0, 50, 50, 0); //왼쪽과 이어진 구름
  rect(231, 104, 52, 30, 20, 0, 0, 20); //오른쪽 끝 잘린구름
  rect(208, 123, 52, 22, 20); //그아래 구름
  rect(210, 170, 49, 16, 20);

  //벽 액자
  stroke('#316BFF'); //선 색상
  fill('#D4FAFF'); //노란색
  rect(474, 116, 55, 72, 3);
  fill('#FFFCBE'); //안쪽블루
  rect(482, 124, 38, 56, 3);

  fill('#CBECFF'); //파란색
  rect(551, 59, 67, 88, 3);
  fill('#FFDCF9'); //안쪽핑크
  rect(561, 68, 47, 69, 3);

  //천장조명
  stroke('#316BFF'); //선 색상
  fill('#FDD2CF'); //레드
  rect(364, 49, 128, 27, 80);
  rect(364, 76, 128, 27, 80);
  rect(364, 103, 128, 27, 80);
  line(428, 0, 428, 49); //천장에서 내려오는 세로선

  //서랍장
  stroke('#316BFF'); //선 색상
  fill('#B8EDC3'); //그린
  rect(373, 426, 26, 49, 37); //왼쪽 다리
  rect(585, 426, 26, 49, 37); //오른쪽 다리
  rect(338, 268, 364, 185, 37); //본체
  rect(351, 281, 302, 157, 27); //본체 안
  line(493, 281, 493, 438); //서랍장 세로선
  line(351, 332, 493, 332); //서랍장 가로선1
  line(351, 384, 493, 384); //서랍장 가로선2
  rect(392, 303, 61, 7, 20); //서랍장 손잡이1
  rect(392, 354, 61, 7, 20); //서랍장 손잡이1
  rect(392, 406, 61, 7, 20); //서랍장 손잡이1
  rect(527, 355, 28, 6, 20); //오른쪽 손잡이 뼈대
  ellipse(523, 358, 15); //오른쪽 동글 손잡이

  //서랍장 위 버섯조명
  stroke('#316BFF'); //선 색상
  fill('#FFC8A9'); //그린
  quad(409, 250, 421, 250, 428, 268, 402, 268); //조명 받침
  rect(365, 224, 100, 27, 70, 70, 5, 5); //버섯 조명 뚜껑

  //책3개
  stroke('#316BFF'); //선 색상
  fill('#BAD1FF'); //블루
  rect(495, 232, 82, 12, 2); //상
  fill('#DDD8FF'); //퍼플
  rect(502, 244, 82, 12, 2); //중
  fill('#FFE8BA'); //옐로
  rect(495, 256, 82, 12, 2); //하

  //핑크소파
  //다리
  stroke('#316BFF'); //선 색상
  fill('#F2DEBA'); //세미브라운
  rect(105, 506, 28, 47, 30); //왼쪽다리
  rect(381, 506, 28, 47, 30); //오른쪽다리
  //본체
  fill('#FFD7E8'); //핑크
  rect(103, 479, 308, 45, 30); //바닥면
  rect(121, 328, 272, 142, 30); //등면
  rect(81, 398, 51, 130, 30); //왼쪽 팔걸이
  rect(380, 398, 51, 130, 30); //왼쪽 팔걸이
  rect(111, 447, 293, 46, 30); //앉는면

  //소파 꾸밈 선_가로지르는 선
  stroke('#316BFF'); //선 색상
  line(166, 368, 192, 394); //1-1
  line(192, 368, 166, 394); //1-2
  line(244, 368, 270, 394); //2-1
  line(270, 368, 244, 394); //2-2
  line(322, 368, 348, 394); //2-1
  line(348, 368, 322, 394); //2-2
  //소파 꾸밈 단추_원
  ellipse(179, 381, 14, 14); //1
  ellipse(257, 381, 14, 14); //2
  ellipse(335, 381, 14, 14); //3

  //쿠션 모서리 둥글게 불가능
  // quad(120, 410, 182, 415, 194, 460, 124, 467, 30);

  //쿠션 2개
  fill('#BAD1FF'); //블루
  stroke('#316BFF'); //선 색상
  rect(193, 407, 110, 46, 50); //사각 쿠션
  rect(192, 425, 115, 7, 50); //사각 쿠션
  fill('#FFF6A2'); //옐로우
  ellipse(157, 428, 96, 77); //원 쿠션 밖
  ellipse(157, 428, 78, 60); //원 쿠션 안

  //액자 속 꽃
  fill('#FFC0ED'); //안쪽핑크
  translate(501, 153);
  noStroke();
  for (let i = 0; i < 10; i++) {
    ellipse(0, 3, 8, 30);
    rotate(PI / 5);
  }
}
